const chapterOne = [
  {
    id: 1,
    hadithNumber: 1,
    raavi:
      "ابو القاسم جعفر بن محمد بن قولویہ تھی فقیہ (مؤلف کتاب ) کہتے ہیں کہ مجھ سے میرے والد رحمۃ اللہ نے بیان کیا انہوں نے سعد بن عبد اللہ بن ابو خلف اشعری سے انہوں نے احمد بن محمد بن عیسیٰ سے انہوں نے محمد بن خالد برقی سے انہوں نے قاسم بن یکی سے انہوں نے اپنے جد حسن بن راشد سے اور انہوں نے عبداللہ بن سنان سے روایت کی ہے کہ امام جعفر صادق علیہ السلام نے فرمایا",
    blackTextOne:
      "حسين بن علي عليهما السلام رسول خدا کی آغوش میں بیٹھے تھے ، آپ نے اپنا سر اٹھایا اور رسول خدا سے کہا اے بابا ! جو آپ کی وفات کے بعد آپ کی زیارت کرے اس کا کیا ثواب ہے؟ پیغمبر اسلام نے فرمایا:",
    arabicText:
      "أَخْبَرَنَا أَبُو الْقَاسِمِ جَعْفَرُ بْنُ مُحَمَّدِ بْنِ قُولَوَيْهِ الْقُمِّيُّ الْفَقِيهُ قَالَ حَدَّثَنِي أَبِي (رحمه الله) عَنْ سَعْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي خَلَفٍ الْأَشْعَرِيِّ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ الْبَرْقِيِّ عَنْ قَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ (ع) قَالَ بَيْنَمَا الْحُسَيْنُ بْنُ عَلِيٍّ (ع) فِي حَجْرِ رَسُولِ اللَّهِ (ص) إِذْ رَفَعَ رَأْسَهُ فَقَالَ لَهُ يَا أَبَتِ مَا لِمَنْ زَارَكَ بَعْدَ مَوْتِكَ فَقَالَ يَا بُنَيَّ مَنْ أَتَانِي زَائِراً بَعْدَ مَوْتِي فَلَهُ الْجَنَّةُ وَ مَنْ أَتَى أَبَاكَ زَائِراً بَعْدَ مَوْتِهِ فَلَهُ الْجَنَّةُ وَ مَنْ أَتَى أَخَاكَ زَائِراً بَعْدَ مَوْتِهِ فَلَهُ الْجَنَّةُ وَ مَنْ أَتَاكَ زَائِراً بَعْدَ مَوْتِكَ فَلَهُ الْجَنَّةُ",
    blackTextTwo:
      "حسین بن علی علیہما السلام رسول خدا کی آغوش میں بیٹھے تھے ، آپ نے اپنا سر اٹھایا اور رسول خدا سے کہا اے بابا! جو آپ کی وفات کے بعد آپ کی زیارت کرے اس کا کیا ثواب ہے؟ پیغمبر اسلام نے فرمایا: اے بیٹے، جو شخص میرے مرنے کے بعد میری زیارت کرے گا اس کی جزا جنت ہے، اور جو تمہارے باپ (علی) کے مرنے (شہادت) کے بعد ان کی زیارت کرے گا اس کی جزا جنت ہے، اور جو تمہارے بھائی (حسن) کے مرنے (شہادت) کے بعد اس کی زیارت کرے گا اس کی جزا جنت ہے، اور جو تمہارے مرنے (شہادت) کے بعد تمہاری زیارت کرے گا اس کی جزا جنت ہے。",
    englishText:
      " My father narrated to me from Sa’d ibn ‘Abdillāh ibn Abī Khalaf Al-Ash’ari, from Aḥmad ibn Muḥammad ibn ‘Isā, from Muḥammad ibn Khālid Al-Barqi, from Qāsim ibn Yaḥyā, from his grandfather Ḥasan ibn Rāshid, from ‘Abdillāh ibn Sinān, who said: Abū ‘Abdillāh (Imam Sādiq (a.s)) said: (One day) while Ḥusain ibn ‘Ali (a.s) was sitting on the lap of the Messenger of Allāh ﷺ, he raised his head and said, “O father! What is the reward for those who come to your ZIYĀRAH after your death?” The Messenger of Allāh ﷺ replied: O my son! Those who come to my Ziyārah after my death will be rewarded with Paradise; those who come to the Ziyārah of your father after his death will be rewarded with Paradise; those who come to the Ziyārah of your brother after his death will be rewarded with Paradise; and those who come to your Ziyārah after your death will be rewarded with Paradise.",
  },
  {
    id: 2,
    hadithNumber: 2,
    raavi:
      "مجھ سے سعد بن عبد اللہ نے بیان کیا انہوں نے احمد بن محمد بن عیسی سے انہوں نے علی بن اسباط سے انہوں نے عثمان بن عیسی سے انہوں نے معلی بن ابو شہاب سے اور انہوں نے امام جعفر صادق علیہ السلام سے روایت کی ہے کہ امام حسین نے رسول خدا سے دریافت کیا کہ جو آپ کی زیارت کرے گا اس کی کیا جزا ہے؟",
    blackTextOne: "پیغمبر اسلام نے فرمایا :",
    arabicText:
      "يا بني من زارني حيا او میتا او زار اباك او زار اخاك او زارك كان حقا على ان ازوره يوم القيامة حتى اخلصه من ذنوبه",
    blackTextTwo:
      "اے بیٹے جو میری زندگی میں یا میرے مرنے کے بعد میری زیارت کرے گا یا جو تمہارے باپ کی زیارت کرے گا یا تمہارے بھائی کی زیارت کرے گا یا تمہاری زیارت کرے گا ، تو مجھ پر واجب ہے کہ قیامت کے دن اس کی زیارت کو جاؤں اور اس کو اس کے گناہوں کے عذاب سے نجات دلاؤں۔",
    englishText: "Your English translation text goes here if available.",
  },
  {
    id: 3,
    hadithNumber: 3,
    raavi:
      "مجھ سے میرے والد رحمۃ اللہ اور محمد بن یعقوب نے بیان کیا انہوں نے احمد بن ادریس سے انہوں نے ایک شخص سے انہوں نے محمد بن سنان سے اور انہوں نے محمد بن علی سے مرفوعا نقل کیا ہے کہ :",
    blackTextOne: "رسول خدا نے فرمایا",
    arabicText:
      "یا علی من زارنی فی حیاتی او بعد مماتی او زارک فی حیاتک او بعد موتک او زار ابنیك في حياتهما او بعد موتهما ضمنت له يوم القيامة ان اخلصه من اهوالها و شدائدها، حتى اصيره معى في درجتی",
    blackTextTwo:
      "اے علی جو شخص میری زندگی میں یا میرے مرنے کے بعد میری زیارت کرے یا تمہاری زندگی میں یا تمہارے مرنے کے بعد تمہاری زیارت کرے یا تمہارے بیٹوں کی زندگی میں یا ان کے مرنے کے بعد ان کی زیارت کرے تو میں ضمانت لیتا ہوں کہ اس کو قیامت کے دن کی وحشت اور اس کی سختیوں سے نجات دلاؤں گا اور وہ میرا ہم درجہ ہو جائے گا۔",
    englishText: "Your English translation text goes here if available.",
  },
  {
    id: 4,
    hadithNumber: 4,
    raavi:
      "مجھ سے محمد بن یعقوب نے بیان کیا انہوں نے بعض محدثین سے کہ جن میں احمد بن ادریس اور محمد بن کی ہیں اور انہوں نے العمر کی بن علی سے انہوں نے کیسی سے ( یہ دونوں امام محمد تقی کے خادم تھے ) اور انہوں نے بعض محدثین شیعہ کے توسط سے مرفوعاً امام محمد باقر سے روایت کی ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا",
    arabicText:
      "من زارنی او زار احداً من ذريتي زرته يوم القيامة فانقذته من اهو الها",
    blackTextTwo:
      "جو میری زیارت کرے یا میری ذریت میں سے کسی کی زیارت کرے تو قیامت کے دن میں اس کی زیارت کروں گا اور اس کے ہولناک ماحول سے اس کو نجات دلاؤں گا۔",
    englishText: "Your English translation text goes here if available.",
  },
  {
    id: 5,
    hadithNumber: 5,
    raavi:
      "مجھ سے محمد بن حسن بن علی بن مہزیار نے بیان کیا انہوں نے اپنے والد حسن سے انہوں نے اپنے والد علی بن مہریار سے انہوں نے عثمان بن عیسی سے انہوں نے معلی بن ابو شہاب سے اور انہوں نے امام جعفر صادق سے روایت کی ہے کہ حسین بن علی علیہما السلام نے رسول خدا سے دریافت کیا:",
    blackTextOne:
      "اے بابا جو شخص آپ کی زیارت کرے اس کی جزا کیا ہے؟ حضرت نے فرمایا:",
    arabicText:
      "يا بني من زارني حيا او میتا او زار اباك او زار اخاك او زارك كان حقا على ان ازوره يوم القيامة فاخلصه من ذنوبه",
    blackTextTwo:
      "اے بیٹے جو شخص میری زندگی میں یا میرے مرنے کے بعد میری زیارت کرے یا تمہارے بھائی کی زیارت کرے یا خود تمہاری زیارت کرے تو اس کا حق مجھ پر بنتا ہے کہ قیامت کے دن میں اس کی زیارت کروں اور اس کے گناہوں کے عذاب سے نجات دلاؤں۔",
    englishText: "Your English translation text goes here if available.",
  },
];

export default chapterOne;
