const chapterOne = [
  {
    id: 1,
    text: 'عظیم الشان شیخ المفید ابو عبد اللہ محمد بن محمد بن النعمان رحمۃ اللہ علیہ آج بھی ان پر اپنی حفاظت اور فضل جاری رکھے ہوئے ہیں، فرماتے ہیں: ابوالحسن احمد بن محمد بن الحسن بن الولید نے مجھے اپنے سے روایت کی۔ والد محمد بن الحسن، محمد بن الحسن الصفر سے، احمد بن محمد بن عیسیٰ سے، محمد بن خالد سے، ابن حماد سے، ابو جمیلہ سے، جابر بن یزید سے کہ ابو جعفر محمد الباقر، آپ صلی اللہ علیہ وسلم نے اپنے والد سے روایت کی ہے کہ: "یقیناً، بندے پر مقرر کردہ فرشتہ (ہر چیز) کو اپنے نامہ اعمال میں لکھتا ہے، لہٰذا تم نیکی کو اس کے شروع اور آخر میں درج کرو۔ کہ) اللہ آپ کو معاف کر دے جو درمیان میں ہوتا ہے۔',
    number: 1,
  },
  {
    id: 2,
    text: 'یہ دوسری حدیث ہے: "الصَّلَوٰةُ خَيْرٌ مِنَ النَّوْمِ" - (Translation: Prayer is better than sleep)',
    number: 2,
  },
  // Add more hadiths for this chapter
];

export default chapterOne;
