// src/Chapters/chapterTwo.js

const chapterTwo = [
  {
    id: 6,
    hadithNumber: 1,
    raavi:
      "مجھ سے میرے والد رحمہ اللہ نے بیان کیا انہوں نے سعد بن عبد اللہ سے انہوں نے احمد بن محمد بن عیسی سے انہوں نے حسن بن محبوب سے انہوں نے آبان سے انہوں نے سدوسی سے اور انہوں نے امام جعفر صادق علیہ السلام سے روایت کی ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا",
    arabicText: "من اتاني زائراً كنت شفيعه يوم القيامة",
    blackTextTwo:
      "جو شخص میری زیارت کو آئے گا ، قیامت کے دن میں اس کی شفاعت کروں گا۔",
  },
  {
    id: 7,
    hadithNumber: 2,
    raavi:
      "مجھ سے محمد بن حسن بن احمد رحمہ اللہ نے بیان کیا انہوں نے محمد بن حسن صفار سے انہوں نے احمد بن محمد بن عیسی سے اور انہوں نے ابن ابی نجران سے روایت کی ہے۔ ابن ابی نجران کا کہنا ہے کہ میں نے امام محمد تقی علیہ السلام سے عرض کیا: میں آپ پر فدا ہو جاؤں ، یہ بتائیے جو شخص اپنے قصد وارادے سے صرف رسول خدا کی زیارت کو جائے اور کوئی اور مقصد نہ ہو تو اس کا ثواب کیا ہے؟",
    blackTextOne: "فرمایا:",
    arabicText: "له الجنة",
    blackTextTwo: "اس کی پاداش جنت ہے",
  },
  {
    id: 8,
    hadithNumber: 3,
    raavi:
      "ہمارے اساتذہ کی ایک جماعت نے مجھ سے بیان کیا انہوں نے محمد بن سکی سے انہوں نے احمد بن محمد بن عیسی سے انہوں نے معاویہ بن حکیم سے اور انہوں نے عبد الرحمن بن ابی نجران سے روایت کی ہے۔ ابن ابی نجران کا بیان ہے کہ میں نے امام محمد تقی علیہ السلام ( ابو جعفر خانی) سے دریافت کیا: جو شخص صرف قبر نبی کی زیارت کے لئے جائے اس کی پاداش کیا ہے؟",
    blackTextOne: "فرمایا:",
    arabicText: "له الجنة",
    blackTextTwo: "جنت ہے",
  },
  {
    id: 9,
    hadithNumber: 4,
    raavi:
      "ہمارے مشائخ (استاد حدیث) کی ایک جماعت نے مذکورہ سند کے ساتھ عبد الرحمن بن ابی نجران سے روایت کی ہے کہ انہوں نے امام محمد تقی علیہ السلام سے سوال کیا جو شخص صرف زیارت رسول خدا کے لئے جائے، کوئی اور اس کا مقصد نہ ہو اس کی کیا جزا ہے؟",
    blackTextOne: "فرمایا:",
    arabicText: "يدخله الله الجنة ان شاء الله ",
    blackTextTwo: " انشاء الله خدا اس کو جنت میں جگہ دے گا۔",
  },
  {
    id: 10,
    hadithNumber: 5,
    raavi:
      "مجھ سے محمد بن عبد اللہ بن جعفر جمیری نے بیان کیا انہوں نے اپنے والد (عبد اللہ) سے انہوں نے احمد بن محمد بن عیسیٰ سے انہوں نے علی بن حکم سے انہوں نے سیف بن عمیرہ سے اور انہوں نے ابو بکر حضرمی سے روایت کی ہے، حضرمی کا کہنا ہے کہ امام جعفر صادق علیہ السلام نے مجھ کو حکم دیا کہ استطاعت بھر زیادہ سے زیادہ جتنی نمازیں پڑھ سکتے ہو پڑھو، اور فرمایا کہ ایسا نہیں ہے کہ تم نے جب چاہا اس عمل کو انجام دے دیا کیونکہ اس کے لئے توفیق شرط ہے اور کار خیر کے لئے مواقع بہت زیادہ ہیں لہذا ایسے مواقع کو غنیمت شمار کرو۔",
    blackTextOne: "پھر حضرت نے فرمایا:",
    arabicText: "اما انه - يسمعك من قريب و يبلغه عنك اذا كنت نائيا",
    blackTextTwo:
      "حقیقت یہ ہے کہ حضرت تقریب سے تمہاری آواز سنتے ہیں اور اگر دور سے زیارت پڑھو تو اس کو آپ تک پہنچائی جاتی ہے۔",
  },
  {
    id: 11,
    hadithNumber: 6,
    raavi:
      "جمیری نے اپنی سابق اسناد سے سیف بن عمیرہ سے اور انہوں نے عامر بن عبد اللہ سے روایت کی ہے۔ عامر کا بیان ہے کہ میں نے امام جعفر صادق علیہ السلام سے عرض کیا کہ میں نے ساربان (اونٹ کے مالک) کو دو یا تین دینار اضافی دیئے ہیں تا کہ وہ مجھے مدینہ پہنچادے۔",
    blackTextOne: "حضرت نے فرمایا:",
    arabicText: "انه يسمعك من قريب و يبلغه عنك من بعيد",
    blackTextTwo:
      "حقیقت یہ ہے کہ آنحضرت نے قریب سے تمہاری زیارت کی آواز سنی اور اگر تم دور سے زیارت پڑھتے تو وہ بھی آپ تک پہنچائی جاتی۔",
  },
  {
    id: 12,
    hadithNumber: 7,
    raavi:
      "مجھ سے محمد بن حسن بن احمد بن ولید نے بیان کیا انہوں نے محمد بن حسن صفار سے انہوں نے احمد بن محمد بن عیسی سے اور انہوں نے عبد الرحمن بن ابی نجران سے روایت کی ہے ، ابن ابی نجران کا بیان ہے کہ میں نے امام محمد تقی علیہ السلام سے عرض کیا: میں آپ پر قربان ہو جاؤں بتائیے جو شخص صرف زیارت قبر نبی کے لئے جائے کوئی اور قصد نہ ہو تو اس کی کیا جزا ہے؟",
    blackTextOne: "حضرت نے فرمایا:",
    arabicText: "يدخله الله الجنة ان شاء الله",
    blackTextTwo: "اس کو خدا داخل بہشت کرے گا۔",
  },
  {
    id: 13,
    hadithNumber: 8,
    raavi:
      "مجھ سے محمد بن یعقوب نے چند محد ثین سے نقل کیا ہے انہوں نے احمد بن محمد بن عیسی سے اور مانے عبد الرحمن بن ابی نجران سے روایت کی ہے۔ ابن ابی نجران کا بیان ہے کہ میں نے امام محمد تقی علیہ السلام سے عرض کیا: میں آپ پر فدا ہو جاؤں بتائیے جو اپنے قصد و ارادے سے صرف زیارت قبر نبی کے لئے آئے اس کی کیا پاداش ہے؟",
    blackTextOne: "حضرت نے فرمایا:",
    arabicText: "له الجنة",
    blackTextTwo: "جنت ہے",
  },
  {
    id: 14,
    hadithNumber: 9,
    raavi:
      "مجھ سے محمد بن حسن بن احمد بن ولید نے بیان کیا انہوں نے محمد بن یعقوب سے انہوں نے علی بن محمد بن بندار سے انہوں نے ابراہیم بن اسحاق سے انہوں نے محمد بن سلیمان دیلمی سے اور انہوں نے ابو جعفر اسلمی سے روایت کی ہے کہ :",
    blackTextOne: "رسول خدا نے فرمایا:",
    arabicText:
      "من اتى مكة حاجاً و لم يزرنى بالمدينة جفوته يوم القيامة ، ومن زارني زائراً وجبت له شفاعتي و من وجبت له شفاعتي وجبت له الجنة ، و من مات في احد الحرمين مكة او المدينة لم يعرض الى الحساب و مات مهاجراً الى الله ، و حشر يوم القيامة مع اصحاب بدر",
    blackTextTwo:
      "جو شخص حج کرنے مکہ آئے اور مدینہ جا کر میری زیارت نہ کرے اس کو قیامت کے دن میں نظر انداز کر دوں گا۔ اور جو میری زیارت کے لئے آئے گا اس کی میں شفاعت کروں گا اور جس کی میں شفاعت کروں گا اس پر جنت واجب ہو جائے گی۔ اور جو مکہ یا مدینہ میں مر جائے اس سے کوئی حساب و کتاب نہیں ہوگا اور وہ مہاجر الی اللہ محسوب ہوگا اور قیامت کے دن اصحاب بدر کے ساتھ محشور ہوگا۔",
  },
  {
    id: 15,
    hadithNumber: 10,
    raavi:
      "مجھ سے حسن بن عبد اللہ بن محمد بن عیسی نے بیان کیا انہوں نے اپنے والد سے انہوں نے حسن بن محبوب سے انہوں نے آبان سے انہوں نے سدوسی سے اور انہوں نے امام جعفر صادق علیہ السلام سے روایت کی ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا:",
    arabicText: "من اتانی زائراً كنت شفيعه يوم القيامة",
    blackTextTwo:
      "جو میری زیارت کرنے آئے گا قیامت میں اس کی میں شفاعت کروں گا۔",
  },
  {
    id: 16,
    hadithNumber: 11,
    raavi:
      "مجھ سے حکیم بن داؤد بن حکیم نے بیان کیا انہوں نے سلمہ بن خطاب سے انہوں نے علی بن سیف سے انہوں نے طفیل بن مالک نخعی سے انہوں نے ابراہیم بن ابو یکی مدنی سے انہوں نے صفوان بن سلیم سے انہوں نے اپنے والد سے اور انہوں نے رسول خدا سے روایت کی ہے کہ:",
    blackTextOne: "آنحضرت نے فرمایا:",
    arabicText: "من زارني في حياتي او بعد موتى كان في جوارى يوم القيامة",
    blackTextTwo:
      "جو شخص میری زندگی میں یا میرے مرنے کے بعد میری زیارت کرے گا قیامت کے دن وہ میرا ہمسایہ ہو گا۔",
  },
  {
    id: 17,
    hadithNumber: 12,
    raavi:
      "حکیم بن داؤد بن حکیم نے سلمہ سے انہوں نے علی بن سیف سے انہوں نے سلیمان بن عمر نھی سے انہوں نے عبداللہ بن حسن سے انہوں نے اپنے باپ سے اور انہوں نے علی بن ابی طالب سے روایت کی ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا:",
    arabicText:
      "من زارني بعد وفاتي كان كمن زارني في حياتي ، و كنت له شهيداً و شافعاً يوم القيامة",
    blackTextTwo:
      "جس نے میرے مرنے کے بعد میری زیارت کی گویا اس نے میری زندگی میں میری زیارت کی اور قیامت کے دن میں اس کا شاہد اور شفیع ہوں گا۔",
  },
  {
    id: 18,
    hadithNumber: 13,
    raavi:
      "حکیم بن داود بن جا م بن داؤد بن حکیم نے سلمہ سے انہوں نے جعفر بن بشیر سے انہوں نے ابان بن عثمان سے انہوں نے سردی سے اور انہوں نے امام جعفر صادق علیہ السلام سے نقل کیا ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا:",
    arabicText: "من اتانى زائراً كنت له شفيعاً يوم القيامة",
    blackTextTwo:
      "جو میری زیارت کے لئے آئے گا قیامت کے دن میں اس کی شفاعت کروں گا۔",
  },
  {
    id: 19,
    hadithNumber: 14,
    raavi:
      "حکیم بن داؤد بن حکیم نے سلمہ سے انہوں نے زید بن ابوزید ہروی سے اور انہوں نے قتیبہ بن سعید سے روایت کی ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا:",
    arabicText: "من اتاني زائراً في المدينة محتسباً كنت له شفيعاً يوم القيامة",
    blackTextTwo:
      "جو ثواب کی نیت سے مدینہ میں میری زیارت کرنے آئے گا قیامت کے دن اس کی میں شفاعت کروں گا۔",
  },
  {
    id: 20,
    hadithNumber: 15,
    raavi:
      "مجھ سے میرے اساتید کی ایک جماعت نے بیان کیا انہوں نے محمد بن یحییٰ اور احمد بن اور لیس سے اور ان دونوں نے مسلمہ سے انہوں نے بعض محدثین کے توسط سے ابن ابی نجران سے نقل کیا ہے کہ ان سے دریافت کیا گیا کہ جو رسول خدا کی زیارت کے لئے جائے اس کا کیا اجر ہے؟",
    blackTextOne: "جواب دیا:",
    arabicText: "يدخله الله الجنة",
    blackTextTwo: "خدا اس کو داخل بہشت کرے گا۔",
  },
  {
    id: 21,
    hadithNumber: 16,
    raavi:
      "مجھ سے میرے اساتیذ کی ایک جماعت نے بیان کیا انہوں نے سعد بن عبد اللہ سے انہوں نے احمد بن محمد بن عیسی سے انہوں نے اپنے والد (محمد) سے انہوں نے حسن بن محبوب سے انہوں نے ابان سے انہوں نے سدوسی سے اور انہوں نے امام جعفر صادق علیہ السلام سے روایت کی ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا:",
    arabicText: "من اتاني زائراً كنت شفيعه يوم القيامة",
    blackTextTwo:
      "جو میری زیارت کرنے آئے گا قیامت کے دن اس کی میں شفاعت کروں گا۔",
  },
  {
    id: 22,
    hadithNumber: 17,
    raavi:
      "مجھ سے ابو الفضل محمد بن احمد بن سلیمان نے بیان کیا انہوں نے موسیٰ بن محمد بن موسیٰ سے انہوں نے محمد بن محمد اشعث سے انہوں نے ابو الحسن موسیٰ بن اسماعیل بن موسیٰ بن جعفر سے انہوں نے اپنے باپ (اسماعیل) سے انہوں نے اپنے باپ (امام موسیٰ کاظم) سے انہوں نے اپنے باپ (امام جعفر بن محمد) سے انہوں نے اپنے باپ (امام محمد باقر) سے اور انہوں نے (چوتھے امام) علی بن الحسین سے روایت کی ہے کہ:",
    blackTextOne: "رسول خدا نے فرمایا:",
    arabicText:
      "من زار قبري بعد موتى كان كمن هاجر الي في حياتي ، فان لم تستطيعوا فابعثوا الى السلام فانه يبلغني",
    blackTextTwo:
      "جس نے میری وفات کے بعد میری زیارت کی گویا اس نے میری زندگی میں میری زیارت کی ، اگر میری زیارت کرنے نہ آسکو تو دور ہی سے مجھ کو سلام کر لو وہ مجھ تک پہنچ جائے گا۔",
  },
  {
    id: 23,
    hadithNumber: 18,
    raavi:
      "مجھ سے میرے والد نے بیان کیا انہوں نے سعد بن عبد اللہ سے انہوں نے احمد بن محمد بن عیسی سے انہوں نے حسین بن سعید سے انہوں نے عثمان بن عیسی سے انہوں نے معلی بن ابوشہاب سے اور انہوں نے امام جعفر صادق علیہ السلام سے روایت کی ہے کہ امام حسین نے رسول خدا سے پوچھا:",
    blackTextOne: "بابا جو آپ کی زیارت کرے گا اس کی کیا پاداش ہوگی؟",
    arabicText:
      "يا بني من زارني حيا او ميتاً كان حقا على ان ازوره يوم القيامة ، و اخلصه من ذنوبه",
    blackTextTwo:
      "بیٹا جو میری زندگی میں یا میری وفات کے بعد میری زیارت کرنے آئے گا تو مجھ پر واجب ہے کہ قیامت کے دن اس کی زیارت کو میں جاؤں اور اس کو اس کے گناہوں کے عذاب سے نجات دلاؤں۔",
  },
  {
    id: 24,
    hadithNumber: 19,
    raavi:
      "مجھ سے محمد بن جعفر رزاز نے بیان کیا انہوں نے محمد بن حسین بن ابی خطاب سے انہوں نے حسن بن محبوب سے انہوں نے جمیل بن صالح سے اور انہوں نے فضل بن یسار سے روایت کی ہے کہ:",
    blackTextOne: "امام محمد باقر نے فرمایا:",
    arabicText: "ان زيارة قبر رسول الله تعدل حجة مع رسول الله مبروراً",
    blackTextTwo:
      "قبر رسول خدا کی زیارت اس حج مقبول کے برابر ہے جو آنحضرت کے ساتھ کیا جائے۔",
  },
  {
    id: 25,
    hadithNumber: 20,
    raavi:
      "مجھ سے محمد بن جعفر رزاز نے بیان کیا انہوں نے محمد بن حسن سے انہوں نے محمد بن اسماعیل سے اور انہوں نے صالح بن عقبہ سے روایت کی ہے کہ زید شحام نے امام جعفر صادق علیہ السلام سے دریافت کیا کہ رسول خدا کی جو شخص زیارت کرے اس کی کیا پاداش ہے؟",
    blackTextOne: "حضرت نے فرمایا:",
    arabicText: "کمن زار الله في عرشه",
    blackTextTwo: "وہ اس شخص کے مانند ہے جس نے (گویا) عرش پر خدا کی زیارت کی۔",
  },
];

export default chapterTwo;
